Обработки/Reports/_КонтрольНаличияВРИОСпециальногоДолжностногоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольНаличияВРИОСпециальногоДолжностногоЛица</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопСвойства</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольНаличияВРИОСпециальногоДолжностногоЛица/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Отчет.Период.Вариант = ВариантСтандартногоПериода.ПрошлыйКвартал;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Период", Отказ); 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет_4662У_НаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
	ОбъектНаСервере.СформироватьЕжеквартальныйОтчет(Истина);
	
КонецФункции 

&НаКлиенте
Процедура СформироватьОтчет_4662У(Команда)
	
	СформироватьОтчет_4662У_НаСервере();
	СохранитьДанныеВФайл();
	
КонецПроцедуры 

&НаКлиенте
Процедура СохранитьДанныеВФайл()
	
	Если Не Отчет.ДопСвойства.Свойство("ПакетДокументов") 
		Или Не (ТипЗнч(Отчет.ДопСвойства.ПакетДокументов) = Тип("ТабличныйДокумент") Или ТипЗнч(Отчет.ДопСвойства.ПакетДокументов) = Тип("ПакетОтображаемыхДокументов")) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для записи в файл.");
		Возврат;
		
	КонецЕсли;
		
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Укажите путь к файлу";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл *.docx| *.docx";
	
	Если Диалог.Выбрать() Тогда
		
		ФайлДанных = Диалог.ПолноеИмяФайла;
		
		Попытка
			Отчет.ДопСвойства.ПакетДокументов.Записать(ФайлДанных, ?(ТипЗнч(Отчет.ДопСвойства.ПакетДокументов) = Тип("ТабличныйДокумент"), ТипФайлаТабличногоДокумента.DOCX, ТипФайлаПакетаОтображаемыхДокументов.DOCX));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + ФайлДанных + " успешно сохранен.");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл не сохранен! " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Отчет.ДопСвойства.Очистить();
	
КонецПроцедуры
